openfoam_runs/run_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          108;
        startFace       92366;
    }
    outlet
    {
        type            patch;
        nFaces          108;
        startFace       92474;
    }
    front
    {
        type            wall;
        inGroups        1(wall);
        nFaces          216;
        startFace       92582;
    }
    back
    {
        type            wall;
        inGroups        1(wall);
        nFaces          216;
        startFace       92798;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          648;
        startFace       93014;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2080;
        startFace       93662;
    }
    hull
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3300;
        startFace       95742;
    }
)

// ************************************************************************* //
